from address import City

class Jung(City):
    def __init__(self) -> None:
        args = ["중구", ]
        sub_citys = [
            ["중앙동", "중앙동1가", "중앙동2가", "중앙동3가", "중앙동4가", "중앙동5가", "중앙동6가", "중앙동7가"],
            ["동광동", "동광동1가", "동광동2가", "동광동3가", "동광동4가", "동광동5가"],
            ["대청동", "대청동1가", "대청동2가", "대청동3가", "대청동4가"],
            ["보수동", "보수동1가", "보수동2가", "보수동3가"],
            ["부평동", "부평동1가", "부평동2가", "부평동3가", "부평동4가"],
            ["광복동", "광복동1가", "광복동2가", "광복동3가", "창선동1가", "창선동2가", "신창동1가", "신창동2가", "신창동3가", "신창동4가"],
            ["남포동", "남포동1가", "남포동2가", "남포동3가", "남포동4가", "남포동5가", "남포동6가"],
            ["영주1동", "대창동2가"],
            ["영주2동", "영주동"],
        ]
        
        super().__init__(*args)

        for sub_city in sub_citys:
            self.subclass.append(City(*sub_city))