from address import City

class Seo(City):
    def __init__(self) -> None:
        args = ["서구"]
        sub_citys = [
            ['동대신동', '동대신1동', '동대신동1가',],
            ['동대신2동', '동대신동2가'],
            ['동대신3동', '동대신동3가'],
            ['서대신동', '서대신1동', '서대신동1가', '서대신동2가'],
            ['서대신3동', '서대신4동', '서대신동3가'],
            ['부민동', '부민동1가', '부민동2가', '부민동3가', '부용동1가', '부용동2가'],
            ['아미동', '아미동1가', '아미동2가'],
            ['초장동'],
            ['충무동', '충무동1가', '충무동2가', '충무동3가', '토성동1가', '토성동2가', '토성동3가', '토성동4가', '토성동5가'],
            ['남부민1동', '남부민2동', '남부민동'],
            ['암남동'],
        ]
        
        super().__init__(*args)

        for sub_city in sub_citys:
            self.subclass.append(City(*sub_city))