t = '''
#부산맛집 #부산여행 #부산가성비맛집

1. 금호회관
주소 : 부산 금정구 오시게로54번길 2 상가동 104호
전화번호 : 010-8374-1134
영업시간 : 11:30-22:30 , 15:00-16:00 브레이크 타임
                  매달 2,4,5번째 일요일 정기 휴무
주차 : 주변 유료 주차장 이용

2. 이가 삼색 샤브칼국수
주소 : 부산 강서구 신호산단2로 43-21
전화번호 : 051-831-1114
영업시간 : 11:00-21:30
                   15:00-16:30 브레이크 타임
                   20:30 라스트 오더
                   정기 휴무(매주 월요일)
주차 : 식당 전용 주차장 있음

3. 퍼짱
주소 : 부산 중구 충장대로9번길 21
전화번호 : 0507-1441-5021
영업시간 : 11:00~19:00 , 18:45 라스트 오더
                 일요일 정기 휴무
주차 : 주변 유료 주차장 이용

4. 메밀짬뽕
주소 : 부산광역시 금정구 오륜대로 47
전화번호 : 0507-1474-9079
영업시간 : 네이버 참고함 매일 09:00~ 19:00
주차 : 식당 앞 11시 ~ 2시 주차가능

5. 행복한 돈까스
주소 : 부산 기장군 기장읍 차성동로 75
전화번호 : 051-724-8989
영업시간 : 평일 11:30~ 20:00 , 매주 주말 휴무
                   브레이크 타임 15:00~17:00
주차 : 기장 시장 공영 주차장 이용

6. 삼도축산
주소 : 부산 사하구 다대로 686
전화번호 : 051-263-4565
영업시간 : 매일 11:30 - 23:00
                   둘째 넷째 화요일 정기휴무
주차 :  2층 식당 입구 주차

7. 거북이가 반한 오리
주소 : 부산 강서구 경전철로 158-6
전화번호 : 051-973-5622
영업시간 : 매일 11:20~21시 까지 , 브레이크 타임 14:30~17:00
주차 : 식당 앞 마당 주차 가능

8. 박가연잎족발
주소 : 부산 사상구 가야대로284번길 7-7
전화번호 : 051-304-4688
영업시간 : 매일 12:00 - 23:00
주차 : 학장천 공영 주차장 이용

9. 북경
주소 : 부산 동구 고관로 129
전화번호 : 051-467-8117
영업시간 : 11:30~22:00 , 매달 1,2,3번째 월요일 정기휴무
주차 : 전용 주차장 없음 , 저는 좌천점 홈플러스 익스프레스 주차했어요

10. 39아구찜
주소 : 부산 동구 정공단로 39
전화번호 : 051-644-3959
영업시간 : 매일 11:00-20:00 , 월요일 휴무
주차 : 전용 주차장 없음 
           식당 앞 가구 거리 공영 주차장(지원 없음)

택제이 메일 주소
takjay8809@gmail.com

택제이 인스타그램
https://www.instagram.com/vj_takjay/

'''


from address import Korea

korea = Korea()

print(korea.calculate(t))